tap "beeftornado/rmtree"
tap "boz/repo"
tap "buo/cask-upgrade"
tap "carlosedp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "hudochenkov/sshpass"
tap "wagoodman/dive"
tap "weaveworks/tap"
tap "yt-dlp/taps"

# GNU Tools
brew "coreutils"
brew "bash"
brew "bash-completion"
brew "binutils"
brew "diffutils"
brew "findutils"
brew "file-formula"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpatch"
brew "gnutls"
brew "grep"
brew "gzip"
brew "less"
brew "make"
brew "rsync"
brew "screen"
brew "telnet"
brew "tree"
brew "watch"
brew "wdiff"
brew "wget"
brew "xz"
brew "zsh"
brew "gpg"

brew "ansible"
brew "openssl"
brew "openssh"
brew "asciinema"
brew "autojump"
brew "docker-completion"
brew "faas-cli"
brew "git"
brew "htop"
brew "bpytop"
brew "hub"
brew "iperf3"
brew "istioctl"
brew "jq"
brew "kubernetes-cli"
brew "krew"
brew "kubernetes-helm"
brew "minikube"
brew "neofetch"
brew "openshift-cli"
brew "qemu"
brew "rlwrap"
brew "sshuttle"
brew "stern"
brew "tmate"
brew "tmux"
brew "ripgrep"
brew "ffmpeg"
brew "liboping"
brew "carlosedp/tap/sshoot"
brew "hudochenkov/sshpass/sshpass"
brew "wagoodman/dive/dive"
brew "gh"
brew "yt-dlp"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

brew "bat"
brew "hyperfine"
brew "git-delta"
brew "exa"
brew "glow"