tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "lukakerr/things"
tap "nicoverbruggen/cask"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "smudge/smudge"
tap "supabase/tap"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Apache Portable Runtime library
brew "apr"
# Mozilla CA certificate store
brew "ca-certificates"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Password hashing library and CLI utility
brew "argon2"
# Spell checker with better logic than ispell
brew "aspell"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# HTTP/2 C Library
brew "libnghttp2"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Extremely Fast Compression algorithm
brew "lz4"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU multiple precision arithmetic library
brew "gmp"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Regular expressions library
brew "oniguruma"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php", restart_service: true
# Dependency Manager for PHP
brew "composer"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Standard SGML representation system for technical documents
brew "docbook"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Command-line tool for generating regular expressions
brew "grex"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Pager program similar to more
brew "less"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Terminal based presentation tool
brew "slides"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Redis PHP extension
brew "shivammathur/extensions/redis@8.1"
# Xdebug PHP extension
brew "shivammathur/extensions/xdebug@8.1"
# General-purpose scripting language
brew "shivammathur/php/php"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# A CLI for configuring 'Night Shift' on macOS 🌕🌖🌗🌘🌑
brew "smudge/smudge/nightlight"
# Application uninstaller
cask "appcleaner"
# Track all your devices' batteries
cask "batteries"
# Design tool
cask "canva"
# Screen capturing tool
cask "cleanshot"
# Offline toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Displays all your GitLab activities in one place
cask "gitdock"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Native app email client for Gmail
cask "mimestream"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "phpmon"
# Native markdown editor
cask "pine"
# Collaboration platform for API development
cask "postman"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Control your tools with a few keystrokes
cask "raycast"
# Tool for managing the OpenSSH ssh client configuration file
cask "ssh-config-editor"
# Text editor for code, markup and prose
cask "sublime-text"
# Quicklook extension for source files
cask "syntax-highlight"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "F5Access", id: 1243219105
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Step Two", id: 1448916662
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835


tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# tap 'puma/puma'
# brew 'puma/puma/puma-dev'

#   __                            _
#  / _| ___  _ __ _ __ ___  _   _| | __ _
# | |_ / _ \| '__| '_ ` _ \| | | | |/ _` |
# |  _| (_) | |  | | | | | | |_| | | (_| |
# |_|  \___/|_|  |_| |_| |_|\__,_|_|\__,_|
#
brew "autojump"
brew "asdf"
brew "awscli@1"
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fswatch"
brew "gettext"
brew "gifsicle"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gpg"
brew "heroku/brew/heroku"
brew "hub"
brew "jq"
brew "mas"
brew "netcat"
brew "openssl"
brew "p7zip"
# brew "parallel"
# brew "pv"
# brew "rclone"
brew "readline"
brew "rename"
brew "shellcheck"
brew "telnet"
brew "tmux"
brew "watch"
brew "wget"
brew "xz"

#                _
#   ___ __ _ ___| | __
#  / __/ _` / __| |/ /
# | (_| (_| \__ \   <
#  \___\__,_|___/_|\_\
#
cask "appcleaner"
cask "atom"
# cask "audiobookbinder"
# cask "balenaetcher"
cask "bartender"
# cask "blackhole"
# cask "brave-browser"
# cask "calibre"
cask "daisydisk"
# cask "db-browser-for-sqlite"
# cask "discord"
cask "divvy"
cask "docker"
cask "dropbox"
# cask "element"
# cask "figma"
cask "firefox"
cask "google-chrome"
# cask "google-cloud-sdk"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
# cask "keycastr"
# cask "keybase"
cask "little-snitch"
# cask "macvim"
cask "microsoft-edge"
# cask "obsidian"
# cask "openvpn-connect"
cask "postico"
cask "skitch"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
# cask "texmaker"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
# cask "vivaldi"
cask "vlc"
# cask "vox"
cask "wavebox"
# cask "windscribe"
# cask "xquartz"

#                        _
#   __ _ _ __  _ __  ___| |_ ___  _ __ ___
#  / _` | '_ \| '_ \/ __| __/ _ \| '__/ _ \
# | (_| | |_) | |_) \__ \ || (_) | | |  __/
#  \__,_| .__/| .__/|___/\__\___/|_|  \___|
#       |_|   |_|

mas "Amphetamine", id: 937984704
mas "CopyClip", id: 595191960
mas "TickTick", id: 966085870
mas "1Password 7", id: 1333542190


tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "giflib"
brew "jpeg", link: true
brew "libpng"
brew "aspell"
brew "atool"
brew "m4"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre"
brew "pkg-config"
brew "pixman"
brew "readline"
brew "xz"
brew "python@3.9"
brew "cairo"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "diffutils"
brew "dos2unix"
brew "fdupes"
brew "flac"
brew "gnutls"
brew "harfbuzz"
brew "lame"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "gawk"
brew "gcc"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "gpatch"
brew "grep"
brew "gzip"
brew "highlight"
brew "ncurses"
brew "htop"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "python@3.10", link: false
brew "less"
brew "pango"
brew "librsvg"
brew "lzip"
brew "make"
brew "vapoursynth"
brew "mpv"
brew "ncdu"
brew "node"
brew "openssh"
brew "optipng"
brew "p7zip"
brew "pandoc"
brew "perl"
brew "potrace"
brew "ranger"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "rust"
brew "sip"
brew "sox"
brew "telnet"
brew "the_silver_searcher"
brew "timidity"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wdiff"
brew "youtube-dl"
cask "android-file-transfer"
cask "authy"
cask "blurred"
cask "gimp"
cask "keepassxc"
cask "kid3"
cask "little-snitch"
cask "micro-snitch"
cask "rar"
cask "rectangle"






# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'phpmon'
cask 'ray'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
